bit-finance/Reports/бит_ФормаВводаБюджетаКомментарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ФормаВводаБюджетаКомментарий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаВводаБюджетаСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ФормаВводаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_ПериодичностьПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПериодичностьПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Reports/бит_ФормаВводаБюджетаКомментарий/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	СписокПараметровНаФорме.Добавить("ФормаВводаБюджетаСсылка");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла; 
	
	Сценарий 	  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФормаВводаБюджетаСсылка, "Сценарий");
    Периодичность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий, "бит_Периодичность");	
	бит_ОтчетыБФСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, "Периодичность", Периодичность, Истина);
	
	ОформитьДинамическийПериод();
	
	ЗаголовокИтогов = НСтр("ru = 'Итого'; en = 'Total'"); 
	бит_ОтчетыБФСервер.УстановитьПараметрСКД(СхемаКомпоновкиДанных, "ЗаголовокИтогов", ЗаголовокИтогов, Истина);
	
КонецПроцедуры // ПриКомпоновкеРезультата()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьДинамическийПериод()
	
	ПолеПериод = СхемаКомпоновкиДанных.НаборыДанных.ФВБ.Поля.Найти("Период");
	ПолеПериод.ВыражениеПредставления =
	"ВЫБОР
	|	КОГДА ЗНАЧЕНИЕЗАПОЛНЕНО(Период)
	|	ТОГДА
	|		ВЫБОР
	|			КОГДА &Периодичность = Значение(Перечисление.бит_ПериодичностьПланирования.День)
	|			ТОГДА Формат(Период, ""ДЛФ=D"")
	|			КОГДА &Периодичность = Значение(Перечисление.бит_ПериодичностьПланирования.неделя)
	|			ТОГДА СтрШаблон(""%1 %2"", Формат(Период, ""ДЛФ=D""), НСтр(""ru = '(неделя)'; en = '(week)'""))
	|			КОГДА &Периодичность = Значение(Перечисление.бит_ПериодичностьПланирования.Декада)
	|			ТОГДА СтрШаблон(""%1 %2"", Формат(Период, ""ДЛФ=D""), НСтр(""ru = '(декада)'; en = '(decade)'""))
	|			КОГДА &Периодичность = Значение(Перечисление.бит_ПериодичностьПланирования.месяц)
	|			ТОГДА Формат(Период, ""ДФ='MMMM yyyy'"")
	|			КОГДА &Периодичность = Значение(Перечисление.бит_ПериодичностьПланирования.квартал)
	|			ТОГДА СтрШаблон(""%1 %2 %3 %4"", Формат(Период, ""ДФ=q""), НСтр(""ru = 'квартал'; en = 'quarter'""), Формат(Период, ""ДФ=yyyy""), НСтр(""ru = 'г.'; en = 'y.'""))
	|			КОГДА &Периодичность =Значение(Перечисление.бит_ПериодичностьПланирования.Полугодие)
	|			ТОГДА 
	|				ВЫБОР 
	|					КОГДА Формат(Период, ""ДФ=q"") = ""3"" ИЛИ Формат(Период, ""ДФ=q"") = ""4""
	|					ТОГДА СтрШаблон(""%1 %2 %3"", НСтр(""ru = '2-ое полугодие'; en = '2nd half-year'""), Формат(Период, ""ДФ=yyyy""), НСтр(""ru = 'г.'; en = 'y.'""))
	|					ИНАЧЕ СтрШаблон(""%1 %2 %3"", НСтр(""ru = '1-ое полугодие'; en = '1nd half-year'""), Формат(Период, ""ДФ=yyyy""), НСтр(""ru = 'г.'; en = 'y.'""))
	|				КОНЕЦ
	|			КОГДА &Периодичность = Значение(Перечисление.бит_ПериодичностьПланирования.Год)
	|			ТОГДА СтрШаблон(""%1 %2"", Формат(Период, ""ДФ=yyyy""), НСтр(""ru = 'г.'; en = 'y.'""))
	|			ИНАЧЕ Формат(Период, ""ДЛФ=Д"")
	|		КОНЕЦ
	|	ИНАЧЕ """"
	|КОНЕЦ";
		
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();

бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "ФВБ");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
